apg_challenge/app/controllers/page_controller.rb

DELETE FROM "malwares"
DELETE FROM "classification_names"
DELETE FROM "classification_types"
DELETE FROM "file_types"
---
  def clear
    Malware.delete_all
    ClassificationName.delete_all
    ClassificationType.delete_all

SELECT  "file_types".* FROM "file_types" WHERE (lower(name) = 'exe')  ORDER BY "file_types"."id" ASC LIMIT 1
SELECT  "classification_types".* FROM "classification_types" WHERE (lower(name) = 'trojan')  ORDER BY "classification_types"."id" ASC LIMIT 1
SELECT "classification_types".* FROM "classification_types"
---
  def upload
    uploaded_io = params[:csvFile]
    #check if they left the upload file blank
    if params[:csvFile].blank?
      flash[:error] = 'You must select a file to upload.'
      redirect_to page_index_path
    #check if they uploaded a different kind of file
    elsif uploaded_io.content_type != "text/csv"
      flash[:error] = 'Only CSV files'
      redirect_to page_index_path
    elsif true
      #save the file
      #time = Time.now.to_i+"_"
      File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
        file.write(uploaded_io.read)
      end

      #read and parse the file
      csv_text = File.read(Rails.root.join('public', 'uploads', uploaded_io.original_filename))
      csv = CSV.parse(csv_text, :headers => true)
      index = 0;
      csv.each do |row|
        begin
          attributes = {:md5 => row[0],
            :className => row[1],
            :classType => row[2,
            :size => row[3],
            :fileType => row[4]}
            index += 1
          createMalware attributes
        rescue => e #in the event it errors out, we'll at least capture that.
          Rails.logger.error { "Encountered an error when trying to save a record. #{e.message} #{e.backtrace.join("\n")}" }
          nil
        end
      end

      flash[:info] = "You've successfully inserted " + index.to_s + " rows into the database!"
      redirect_to page_results_path
    end
  end


  def results
    @types = Hash.new
    type = ClassificationType.all