app/controllers/tablemd5s_controller.rb

  def index

    # Have access to all columns in the table for all MD5s.
    @tabledata = Tablemd5.all
---
SELECT "tablemd5s".* FROM "tablemd5s"  ORDER BY steps desc